zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4hvms128k_48_qfn.h
    /* P1.3 */
    P1_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_3_MSC0_SENSE                 =  4,       /* msc[0].sense:13 */
    P1_3_MSC0_SHIELD                =  5,       /* msc[0].shield:13 */
    P1_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_3_MSC0_EXT_FRM_START         =  8,       /* Digital Active - msc[0].ext_frm_start */
    P1_3_LIN_LIN_EN0                =  9,       /* Digital Active - lin.lin_en[0]:1 */
    P1_3_SCB1_UART_RX               = 10,       /* Digital Active - scb[1].uart_rx:0 */
    P1_3_TCPWM_LINE_COMPL3          = 11,       /* Digital Active - tcpwm.line_compl[3]:1 */
    P1_3_SCB1_SPI_SELECT0           = 12,       /* Digital Deep Sleep - scb[1].spi_select0 */
    P1_3_SCB1_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[1].i2c_scl:0 */

    /* P1.4 */
    P1_4_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_4_MSC0_SENSE                 =  4,       /* msc[0].sense:14 */
    P1_4_MSC0_SHIELD                =  5,       /* msc[0].shield:14 */
    P1_4_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_4_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_4_PERI_VIRT_IN_2             =  8,       /* Digital Active - peri.virt_in_2 */
    P1_4_SCB1_UART_CTS              = 10,       /* Digital Active - scb[1].uart_cts:0 */
    P1_4_TCPWM_LINE_COMPL4          = 11,       /* Digital Active - tcpwm.line_compl[4]:1 */
    P1_4_SCB0_SPI_MOSI              = 12,       /* Digital Deep Sleep - scb[0].spi_mosi:1 */
    P1_4_CPUSS_SWD_CLK              = 14,       /* Digital Deep Sleep - cpuss.swd_clk */

    /* P1.5 */
    P1_5_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_5_MSC0_SENSE                 =  4,       /* msc[0].sense:15 */
    P1_5_MSC0_SHIELD                =  5,       /* msc[0].shield:15 */
    P1_5_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_5_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_5_PERI_VIRT_IN_1             =  8,       /* Digital Active - peri.virt_in_1 */
    P1_5_SCB1_UART_RTS              = 10,       /* Digital Active - scb[1].uart_rts:0 */
    P1_5_TCPWM_LINE3                = 11,       /* Digital Active - tcpwm.line[3]:1 */
    P1_5_SCB0_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[0].spi_clk:1 */
    P1_5_CPUSS_SWD_DATA             = 14,       /* Digital Deep Sleep - cpuss.swd_data */
    P1_5_LPCOMP_COMP0               = 15,       /* Digital Deep Sleep - lpcomp.comp[0]:1 */

    /* P1.6 */
    P1_6_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_6_MSC0_SENSE                 =  4,       /* msc[0].sense:16 */
    P1_6_MSC0_SHIELD                =  5,       /* msc[0].shield:16 */
    P1_6_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_6_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_6_PERI_VIRT_IN_3             =  8,       /* Digital Active - peri.virt_in_3 */
    P1_6_TCPWM_LINE4                = 11,       /* Digital Active - tcpwm.line[4]:1 */
    P1_6_SCB1_SPI_SELECT2           = 12,       /* Digital Deep Sleep - scb[1].spi_select2 */

    /* P1.7 */
    P1_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P1_7_MSC0_SENSE                 =  4,       /* msc[0].sense:17 */
    P1_7_MSC0_SHIELD                =  5,       /* msc[0].shield:17 */
    P1_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P1_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P1_7_PASS0_DSI_SAR_DATA0        = 10,       /* Digital Active - pass[0].dsi_sar_data[0] */
    P1_7_SCB1_SPI_SELECT3           = 12,       /* Digital Deep Sleep - scb[1].spi_select3 */

    /* P3.0 */
    P3_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_0_MSC0_SENSE                 =  4,       /* msc[0].sense:18 */
    P3_0_MSC0_SHIELD                =  5,       /* msc[0].shield:18 */
    P3_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_0_MSC0_OBS_DATA0             =  8,       /* Digital Active - msc[0].obs_data[0] */
    P3_0_PASS0_DSI_SAR_DATA1        = 10,       /* Digital Active - pass[0].dsi_sar_data[1] */
    P3_0_TCPWM_LINE_COMPL4          = 11,       /* Digital Active - tcpwm.line_compl[4]:0 */
    P3_0_SCB0_SPI_MISO              = 12,       /* Digital Deep Sleep - scb[0].spi_miso:1 */
    P3_0_LPCOMP_COMP1               = 15,       /* Digital Deep Sleep - lpcomp.comp[1]:1 */

    /* P3.1 */
    P3_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_1_MSC0_SENSE                 =  4,       /* msc[0].sense:19 */
    P3_1_MSC0_SHIELD                =  5,       /* msc[0].shield:19 */
    P3_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_1_MSC0_OBS_DATA1             =  8,       /* Digital Active - msc[0].obs_data[1] */
    P3_1_PASS0_DSI_SAR_DATA2        = 10,       /* Digital Active - pass[0].dsi_sar_data[2] */
    P3_1_TCPWM_LINE4                = 11,       /* Digital Active - tcpwm.line[4]:0 */

    /* P3.2 */
    P3_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_2_MSC0_SENSE                 =  4,       /* msc[0].sense:20 */
    P3_2_MSC0_SHIELD                =  5,       /* msc[0].shield:20 */
    P3_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_2_MSC0_OBS_DATA2             =  8,       /* Digital Active - msc[0].obs_data[2] */
    P3_2_PASS0_DSI_SAR_DATA3        = 10,       /* Digital Active - pass[0].dsi_sar_data[3] */
    P3_2_TCPWM_LINE_COMPL3          = 11,       /* Digital Active - tcpwm.line_compl[3]:0 */

    /* P4.0 */
    P4_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_0_MSC0_SENSE                 =  4,       /* msc[0].sense:45 */
    P4_0_MSC0_SHIELD                =  5,       /* msc[0].shield:45 */
    P4_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_0_CXPI_CXPI_RX0              =  8,       /* Digital Active - cxpi.cxpi_rx[0]:0 */
    P4_0_SCB0_UART_RX               = 10,       /* Digital Active - scb[0].uart_rx:1 */
    P4_0_TCPWM_LINE4                = 11,       /* Digital Active - tcpwm.line[4]:2 */
    P4_0_SCB2_SPI_CLK               = 12,       /* Digital Deep Sleep - scb[2].spi_clk */

